АлогистикТест2/src/Documents/алк_РасформированиеПакетов/алк_РасформированиеПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РасформированиеПакетов</name>
  <basedOn>Document.алк_ПеремещениеЗапасов</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_РасформированиеПакетов/ObjectModule.bsl
#Область ПроцедурыЗаполненияДокумента
	
// Обработчик заполнения документа по структуре
//
// Параметры:
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
КонецПроцедуры

// Обработчик заполнения документа на основании Приходной накладной.
//
// Параметры:
//  ДанныеЗаполнения - Структура - Основание для заполнения документа.
//
Процедура ЗаполнитьПоПеремещениеЗапасов(ДанныеЗаполнения, Операция = "") Экспорт
	
	// Заполнение шапки документа.
	ДокументОснование 	= ДанныеЗаполнения.Ссылка;
	Организация 		= ДанныеЗаполнения.Организация;
	СтруктурнаяЕдиница 	= ДанныеЗаполнения.СтруктурнаяЕдиницаПолучатель;
	Направление 		= ДанныеЗаполнения.Направление;
	
	Для Каждого ТекСтрокаЗапасы Из ДанныеЗаполнения.Запасы Цикл
		НоваяСтрока = Запасы.Добавить();			
		НоваяСтрока.КоличествоПакетов = ТекСтрокаЗапасы.КоличествоПакетов;
		НоваяСтрока.Номенклатура = ТекСтрокаЗапасы.Номенклатура;
		НоваяСтрока.СерийныйНомер = ТекСтрокаЗапасы.СерийныйНомер;			
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоПеремещениюЗапасов() 

// Обработчик заполнения на основании данных заполнения.
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ОбработчикЗаполнения(ДанныеЗаполнения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		ОнЖе = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьЗапасыПоТЧДокументыОснования();
	
КонецПроцедуры

Процедура ЗаполнитьЗапасыПоТЧДокументыОснования()
	
	Запасы.Очистить();
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.алк_ПеремещениеЗапасов") Тогда
		
		ЗаполнитьПоПеремещениеЗапасов(ДокументОснование);
		
	КонецЕсли
	
	
КонецПроцедуры  //ЗаполнитьЗапасыПоТЧДокументыОснования()

#КонецОбласти


#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.алк_РасформированиеПакетов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	
	// для древестных гранул есть движениетолько по регистру запасы алк_ЗапасыНаСкладахСерии
	
	Если Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
		
		РфпСервер.ОтразитьЗапасыНаСкладахСерии(ДополнительныеСвойства, Движения, Отказ); 
		
	Иначе 
		
		Если Дата >= Константы.алк_ДатаНачалаДвиженийПоЗапасамОрганизации.Получить() Тогда
			РфпСервер.ОтразитьЗапасыОрганизации(ДополнительныеСвойства, Движения, Отказ);		
		КонецЕсли;
		
		РфпСервер.ОтразитьЗапасыОрганизацииСерии(ДополнительныеСвойства, Движения, Отказ);  
		
	КонецЕсли;
	
	// Отражение по "Последовательностям"
	РфпСервер.ОтразитьДокументыПоследовательностиПродукция(ДополнительныеСвойства, Движения, Отказ);
	
	// СерийныеНомера
	УправлениеНебольшойФирмойСервер.ОтразитьСерийныеНомераГарантии(ДополнительныеСвойства, Движения, Отказ);
	
	ЗаписыватьДвиженияВНовыеРегистры = РФП_ПроведениеДокументовСервер.ЗаписыватьДвиженияВНовыеРегистры(Дата);
	
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда 
		РфпСервер.ОтразитьПроизводствоОборот(ДополнительныеСвойства, Движения, Отказ);
		РфпСервер.ОтразитьОстаткиЗапасов(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);    
	
	
	//Если НЕ Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
	//	Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыОрганизацииСерии");
	//Иначе
	//	//Отказ = РфпСервер.КонтрольОтрицательныхостатковПоРегистру(РежимПроведения, ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии");
	//	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ЗапасыНаСкладахСерии", Отказ);
	//КонецЕсли; 
	
	// Контроль остатков  
	Если ЗаписыватьДвиженияВНовыеРегистры Тогда
		Движения.алк_ОстаткиЗапасов.Записать(); 
		РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ);  
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЗаполнитьПоДокументамОснованиям") Тогда
		
		Если ДанныеЗаполнения.ЗаполнитьПоДокументамОснованиям Тогда
			ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, "ОбработчикЗаполнения");
		КонецЕсли; 
		
	Иначе
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
		СтратегияЗаполнения[Тип("ДокументСсылка.алк_ПеремещениеЗапасов")] = "ЗаполнитьПоПеремещениеЗапасов";
		
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);			
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//Соберем массив для контроля остатков  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|  алк_ОстаткиЗапасов.СерийныйНомер
		|ИЗ
		|  РегистрНакопления.алк_ОстаткиЗапасов КАК алк_ОстаткиЗапасов
		|ГДЕ
		|  алк_ОстаткиЗапасов.Регистратор = &Регистратор
		|  И НЕ алк_ОстаткиЗапасов.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("Регистратор", Ссылка);  
		РезультатЗапроса = Запрос.Выполнить();  
		Выборка = РезультатЗапроса.Выгрузить();
		
		МассивСНДоЗаписи = Выборка.ВыгрузитьКолонку("СерийныйНомер");
		
		ДополнительныеСвойства.Вставить("МассивСНДоЗаписи", МассивСНДоЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	РфпСервер.ВыполнитьКонтрольОстатков(ДополнительныеСвойства, "алк_ОстаткиЗапасов", Отказ, РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры
